Returns the instance of FailureDefinitionRegistry.
  Namespace:   Autodesk.Revit.ApplicationServices
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2011
 Syntax
  C#
public static FailureDefinitionRegistry GetFailureDefinitionRegistry()
  Visual Basic
Public Shared Function GetFailureDefinitionRegistry As FailureDefinitionRegistry
  Visual C++
public:
static FailureDefinitionRegistry^ GetFailureDefinitionRegistry()
 Return Value
 The instance of FailureDefinitionRegistry.
 See Also
  ControlledApplication Class
  Autodesk.Revit.ApplicationServices Namespace